# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

example = "a"
print(type(example))

example = 12
print(type(example))

example = 2 * 5 / 12
print(type(example))