# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

example: str = "a"
print(type(example))

example: int = 12
print(type(example))

example: float = 2 * 5 / 12
print(type(example))

example: bool = True
print(type(example))

